In [1]:
import numpy as np
import pandas as pd

In [13]:
animals = pd.DataFrame(np.arange(16).reshape((4,4)),
                      columns = list('WXYZ'),
                      index = ['Dog', 'Cat', 'Bird', 'Mouse'])

animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [14]:
animals.ix[1:2, ['W', 'Y']] = np.nan

C:\Users\82102\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [15]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [16]:
behavior_map = {'W': 'good', 'X': 'bad', 'Y': 'good', 'Z': 'bad'}

In [17]:
animal_col = animals.groupby(behavior_map, axis = 1)

animal_col.sum()

        bad  good
Dog     4.0   2.0
Cat    12.0   0.0
Bird   20.0  18.0
Mouse  28.0  26.0

In [18]:
behav_series = pd.Series(behavior_map)

behav_series

W    good
X     bad
Y    good
Z     bad
dtype: object

In [20]:
animals.groupby(behav_series, axis = 1).count()

       bad  good
Dog      2     2
Cat      2     0
Bird     2     2
Mouse    2     2

In [21]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [23]:
animals.groupby(len).sum()

# group by col's character length

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [25]:
animals.groupby(len, axis = 1).sum()

# group by row's character length

          1
Dog     6.0
Cat    12.0
Bird   38.0
Mouse  54.0

In [29]:
keys = list('ABAB')

In [30]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [28]:
animals.groupby([len, keys]).max()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15

In [40]:
hier_col = pd.MultiIndex.from_arrays([['NY', 'NY', 'NY', 'SF', 'SF'], [1,2,3,1,2]], names = ['City', 'sub_value'])

# MultiIndex.from_arrays
# Convert list of arrays to MultiIndex.

# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.MultiIndex.html

In [41]:
dframe_hr = pd.DataFrame(np.arange(25).reshape(5,5), columns = hier_col )

In [43]:
dframe_hr = dframe_hr * 100
dframe_hr

City           NY                      SF
sub_value       1       2       3       1       2
0               0   10000   20000   30000   40000
1           50000   60000   70000   80000   90000
2          100000  110000  120000  130000  140000
3          150000  160000  170000  180000  190000
4          200000  210000  220000  230000  240000